// Концепция «клиент-сервер»


// Клиент ===> Запрос через протокол HTTP на получение данных для приложения ===> Сервер
// Клиент <=== Данные в формате JSON <=== Сервер
// Клиент ===> Запрос через протокол HTTP для записи новых данных на сервер ===> Сервер
// Клиент <=== Информация о записи в формате JSON <=== Сервер

// Концепция "клиент-сервер" - это важное понятие веб-разработки
// Она открывает возможности для масштабирования и работы с большими объемами информации
// Позволяет быть коду легким и быстрым