// HTTP - протокол передачи гипертекста
// HTTP - это набор правил для передачи информации в интернете

//Цикл HTTP:
//Клиент == HTTP запрос ==> Сервер
//Клиент <== HTTP ответ == Сервер

//Структура HTTP-запроса:
// Метод: тип действия (GET, POST, PUT, DELETE, ...)
// URL: адрес сервера
// Заголовки (headers): дополнительная информация о запросе
// Тело (body): место для данных, отправляемых на сервер

//Структура HTTP-ответа:
// Код состояния: числовой код, описывающий успешность выполнения запроса (200, 400 ....)
// Заголовки (headers): дополнительная информация об ответе или сервере
// Тело (body): данные, которые сервер отправляет обратно


// Протокол HTTP - это основа общения между клиентом и сервером в интернете
// HTTP-запросы и ответы состоят из нескольких частей, каждая из которых имеет свое значение