// Правило 1.
// Использовать короткие и понятные названия переменных

    let price; // правильно

    let something; // неправильно

// Правило 2.
// Все переменные пишем на английском языке, никакого транслита

    let counter; // правильно
    let goods; // правильно
    let cars; // правильно

    let chetchik; // неправильно
    let tovari; // неправильно
    let mashini; // неправильно

// Правило 3.
// 2 варианта наименования переменных из нескольких слов:

//    * camelCase
//    * snake_case

//  В JS чаще всего используется camelCase!

// Правило 4.
// Булевы переменные именуем со слов is(является) или has(имеет)
// Функции именуем с глагола, например, getPrice(дайЦену), calcSum(посчитайСумму)
